---
kind: property
id: P:Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs.TypeId
source: html/8483e71e-0fec-c382-7b13-f53ac5c9741d.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs.TypeId Property

The type id of the newl external data instance that is being added.

## Syntax (C#)
```csharp
public ElementId TypeId { get; }
```